aroyer-qc/Digini/Peripheral/src/port/STM32F1xx/lib_class_STM32F1_i2s.cpp
    // ---- Module configuration ----
    RCC->APB1ENR  |=  m_pInfo->RCC_APB1xPeriph;          // I2S exist only on APB1
    RCC->APB1RSTR |=  m_pInfo->RCC_APB1xPeriph;          // Reset I2S
    RCC->APB1RSTR &= ~m_pInfo->RCC_APB1xPeriph;          // Release reset signal of I2S

    // ---- GPIO configuration ----
    IO_PinInit(m_pInfo->MCLK);
    IO_PinInit(m_pInfo->CK);
    IO_PinInit(m_pInfo->SD);
    IO_PinInit(m_pInfo->WS);

    m_Status = SYS_IDLE;
    //m_NoMemoryIncrement = false; ??

    // Preinit register that won't change
    pDMA = m_pInfo->pDMA_Stream;
    pDMA->PAR = uint32_t(&m_pInfo->pI2Sx->DR);          // Configure receive data register
    pDMA->CR  = DMA_PERIPH_TO_MEMORY          |
                DMA_MODE_NORMAL               |
                DMA_PERIPH_NO_INCREMENT       |
                DMA_MEMORY_INCREMENT          |
                DMA_P_DATA_ALIGN_BYTE         |  //I2S3_DMAx_PERIPH_DATA_SIZE
                DMA_M_DATA_ALIGN_BYTE         |  //I2S3_DMAx_MEM_DATA_SIZE
                DMA_P_BURST_SINGLE            |
                DMA_M_BURST_SINGLE            |
                DMA_PRIORITY_HIGH             |
                DMA_SxCR_TCIE                 |
        //hdma_i2sTx.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
        //hdma_i2sTx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
                m_pInfo->DMA_Channel;


#if 0
/**
  * @note   if an external clock is used as source clock for the I2S, then the define
  *         I2S_EXTERNAL_CLOCK_VAL in file stm32f4xx_conf.h should be enabled and set
  *         to the value of the the source clock frequency (in Hz).
  */
//void I2S_Init(SPI_TypeDef* SPIx, I2S_InitTypeDef* I2S_InitStruct)
    uint16_t tmpreg = 0;
    uint16_t i2sdiv = 2;
    uint16_t i2sodd = 0;
    uint16_t packetlength = 1;
    uint32_t tmp = 0, i2sclk = 0;
  #ifndef I2S_EXTERNAL_CLOCK_VAL
    uint32_t pllm = 0;
    uint32_t plln = 0;
    uint32_t pllr = 0;
  #endif // I2S_EXTERNAL_CLOCK_VAL

    //----------------------- SPIx I2SCFGR & I2SPR Configuration -----------------
    // Clear I2SMOD, I2SE, I2SCFG, PCMSYNC, I2SSTD, CKPOL, DATLEN and CHLEN bits
    SPIx->I2SCFGR &= I2SCFGR_CLEAR_MASK;
    SPIx->I2SPR    = 0x0002;

    // Get the I2SCFGR register value
    tmpreg = SPIx->I2SCFGR;

    // If the default value has to be written, reinitialize i2sdiv and i2sodd
    if(I2S_InitStruct->I2S_AudioFreq == I2S_AudioFreq_Default)
    {
        i2sodd = (uint16_t)0;
        i2sdiv = (uint16_t)2;
    }
    // If the requested audio frequency is not the default, compute the prescaler
    else
    {
        // Check the frame length (For the Prescaler computing) *******************
        if(I2S_InitStruct->I2S_DataFormat == I2S_DataFormat_16b)
        {
            packetlength = 1;       // Packet length is 16 bits
        }
        else
        {
            packetlength = 2;       // Packet length is 32 bits
        }

        // Get I2S source Clock frequency  ****************************************

        // If an external I2S clock has to be used, this define should be set in the project configuration or in the stm32f4xx_conf.h file
      #ifdef I2S_EXTERNAL_CLOCK_VAL
        if((RCC->CFGR & RCC_CFGR_I2SSRC) == 0)                                                                  // Set external clock as I2S clock source
        {
            RCC->CFGR |= (uint32_t)RCC_CFGR_I2SSRC;
        }

        i2sclk = I2S_EXTERNAL_CLOCK_VAL;                                                                        // Set the I2S clock to the external clock  value

      #else // There is no define for External I2S clock source
        if((RCC->CFGR & RCC_CFGR_I2SSRC) != 0)                                                                  // Set PLLI2S as I2S clock source
        {
            RCC->CFGR &= ~(uint32_t)RCC_CFGR_I2SSRC;
        }

        plln = (uint32_t)(((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SN) >> RCC_PLLI2SCFGR_PLLI2SN_Pos));          // Get the PLLI2SN value
        pllr = (uint32_t)(((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SR) >> RCC_PLLI2SCFGR_PLLI2SR_Pos));          // Get the PLLI2SR value
        pllm = (uint32_t)(RCC->PLLCFGR & RCC_PLLCFGR_PLLM);                                                     // Get the PLLM value
        i2sclk = (uint32_t)(((HSE_VALUE / pllm) * plln) / pllr);                                                // Get the I2S source clock value
      #endif // I2S_EXTERNAL_CLOCK_VAL

        // Compute the Real divider depending on the MCLK output state, with a floating point
        if(I2S_InitStruct->I2S_MCLKOutput == I2S_MCLKOutput_Enable)
        {
            tmp = (uint16_t)(((((i2sclk >> 8) * 10) / I2S_InitStruct->I2S_AudioFreq)) + 5);                    // MCLK output is enabled
        }
        else
        {
            tmp = (uint16_t)(((((i2sclk / (packetlength << 5)) * 10) / I2S_InitStruct->I2S_AudioFreq)) + 5);    // MCLK output is disabled
        }

        tmp = tmp / 10;                                                                                         // Remove the flatting point
        i2sodd = (uint16_t)(tmp & (uint16_t)0x0001);                                                            // Check the parity of the divider
        i2sdiv = (uint16_t)((tmp - i2sodd) >> 1);                                                                // Compute the i2sdiv prescaler
        i2sodd = (uint16_t) (i2sodd << 8);                                                                      // Get the Mask for the Odd bit (SPI_I2SPR[8]) register
    }

    // Test if the divider is 1 or 0 or greater than 0xFF
    if((i2sdiv < 2) || (i2sdiv > 0xFF))
    {                                                                                                           // Set the default values
        i2sdiv = 2;
        i2sodd = 0;
    }

    // Write to SPIx I2SPR register the computed value
    SPIx->I2SPR = (uint16_t)((uint16_t)i2sdiv | (uint16_t)(i2sodd | (uint16_t)I2S_InitStruct->I2S_MCLKOutput));

    // Configure the I2S with the SPI_InitStruct values
    tmpreg |= (uint16_t)((uint16_t)SPI_I2SCFGR_I2SMOD              |
                         (uint16_t)(I2S_InitStruct->I2S_Mode       |
                         (uint16_t)(I2S_InitStruct->I2S_Standard   |
                         (uint16_t)(I2S_InitStruct->I2S_DataFormat |
                         (uint16_t)I2S_InitStruct->I2S_CPOL))));

    // Write to SPIx I2SCFGR
    SPIx->I2SCFGR = tmpreg;
}
    #endif
































    // I2S DMA IRQ Channel configuration
    PriorityGroup = NVIC_GetPriorityGrouping();
    NVIC_SetPriority(m_pInfo->I2S_DMA_IRQn, NVIC_EncodePriority(PriorityGroup, 5, 0));
    NVIC_EnableIRQ(m_pInfo->I2S_DMA_IRQn);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           RegisterCallback
//
//  Parameter(s):   pCallback       Callback pointer
//  Return:         None
//
//  Description:    Register callback for user code in ISR
//
//-------------------------------------------------------------------------------------------------
void I2S_Driver::RegisterCallback(CallbackInterface* pCallback)
{
    m_pCallback = pCallback;
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           EnableCallbackType
//
//  Parameter(s):   CallBackType    Type if the ISR callback
//                  pContext        Context for ISR
//  Return:         None
//
//  Description:    Enable the type of interrupt for the callback.
//
//-------------------------------------------------------------------------------------------------
void I2S_Driver::EnableCallbackType(int CallBackType, void* pContext)
{
    switch(CallBackType)
    {
        case I2S_CALLBACK_HALF_COMPLETE:
        {
            m_pContextHalf  = pContext;
            m_CallBackType |= CallBackType;
        }
        break;

