aroyer-qc/Digini/Peripheral/src/port/STM32F1xx/lib_class_STM32F1_i2s.cpp
        case I2S_CALLBACK_COMPLETE:
        {
            m_pContext      = pContext;
            m_CallBackType |= CallBackType;
        }
        break;

        case I2S_CALLBACK_ERROR:
        {
            m_pContextERROR = pContext;
            m_CallBackType |= CallBackType;
        }
        break;
    }
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      SetFrequency
//
//   Parameter(s):  Frequency           Audio frequency used to play the audio stream.
//   Return Value:  SystemState_e
//
//   Description:   Update the audio frequency
//
//-------------------------------------------------------------------------------------------------
SystemState_e I2S_Driver::SetFrequency(I2S_Frequency_e Frequency)
{
    nOS_TickCounter TickStart;

    // Disable the PLLI2S
    CLEAR_BIT(RCC->CR, RCC_CR_PLLI2SON);

    // Wait here until PLLI2S is disabled or time out
    TickStart = GetTick();

    while((RCC->CR & RCC_CR_PLLI2SRDY) != 0)
    {
        if(TickHasTimeOut(TickStart, I2S_PLL_TIME_OUT) == true)
        {
            return SYS_TIME_OUT;            // Return in case of timeout detected
        }
    }

    // I2S clock config
    // PLLI2S_VCO = f(VCO clock) = f(PLLI2S clock input) × (PLLI2SN/PLLM)
    // I2SCLK = f(PLLI2S clock output) = f(VCO clock) / PLLI2SR
    RCC->PLLI2SCFGR = (I2S_Driver::m_PLLN[Frequency] << RCC_PLLI2SCFGR_PLLI2SN_Pos) | (I2S_Driver::m_PLLR[Frequency] << RCC_PLLI2SCFGR_PLLI2SR_Pos);

    // Enable the PLLI2S
    SET_BIT(RCC->CR, RCC_CR_PLLI2SON);

    // Wait till PLLI2S is ready
    TickStart = GetTick();

    while((RCC->CR & RCC_CR_PLLI2SRDY) == 0)
    {
        if(TickHasTimeOut(TickStart, I2S_PLL_TIME_OUT) == true)
        {
            return SYS_TIME_OUT;            // Return in case of timeout detected
        }
    }

  return SYS_READY;

// Update the I2S audio frequency configuration
//??? why I2S3_Init(AudioFreq);
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      GetStatus
//
//   Parameter(s):  None
//   Return Value:  SystemState_e
//
//   Description:   Return general status of the driver
//
//-------------------------------------------------------------------------------------------------
SystemState_e I2S_Driver::GetStatus(void)
{
    return m_Status;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Transmit
//
//   Parameter(s):  pBuffer     Pointer to buffer address.
//                  Size        Number of data to be written.
//   Return Value:  None
//
//   Description:   Sends n-Bytes on the I2S interface using DMA.
//
//-------------------------------------------------------------------------------------------------
SystemState_e I2S_Driver::Transmit(uint16_t* pBuffer, size_t Size)
{
    uint32_t            Register;
    DMA_Stream_TypeDef* pDMA;

    if((pBuffer == nullptr) || (Size == 0))
    {
        return SYS_ERROR;
    }

    if(m_Status != SYS_READY)
    {
        return SYS_BUSY;
    }

    // Set state and reset error code
    m_Status = SYS_BUSY_TX;
    //hi2s->ErrorCode = HAL_I2S_ERROR_NONE;
    m_pBuffer = pBuffer;

    Register = m_pInfo->pI2Sx->I2SCFGR & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN);

    if((Register == uint32_t(I2S_DATAFORMAT_24B)) || (Register == uint32_t(I2S_DATAFORMAT_32B)))
    {
        m_TX_transfertSize  = (Size << 1);
        m_TX_transfertCount = (Size << 1);
    }
    else
    {
        m_TX_transfertSize  = Size;
        m_TX_transfertCount = Size;
    }

    pDMA  = m_pInfo->pDMA_Stream;

    m_Status = SYS_BUSY_TX;                 // Set flag to busy in TX
    pDMA->M0AR = uint32_t(pBuffer);       // Set DMA source
    pDMA->PAR  = uint32_t(&m_pInfo->pI2Sx->DR);        // Configure DMA Stream destination address
    // TODO size must be of the buffer size used by DMA
    pDMA->NDTR = Size;                      // Set size of the TX
    pDMA->CR &= uint32_t(~DMA_SxCR_DBM);  // Clear DBM bit
    DMA_EnableInterrupt(pDMA, m_pInfo->IT_Flag);                                             // TODO if transfer is less than HT of full buffer lenght.. handle ending
    SET_BIT(pDMA->FCR, DMA_SxFCR_FEIE);      // Enable Common interrupts
    SET_BIT(pDMA->CR, DMA_SxCR_EN);          // Enable the DMA module
    DMA_ClearFlag(pDMA, m_pInfo->IT_Flag);   // Clear IRQ DMA flag

    // Check if the I2S is already enabled
//    if(CheckBit(m_pInfo->pI2Sx->I2SCFGR, SPI_I2SCFGR_I2SE) == 0)   // ?? why ?
    {
        // Enable I2S peripheral
        SET_BIT(m_pInfo->pI2Sx->I2SCFGR, SPI_I2SCFGR_I2SE);
    }

    // Check if the I2S Tx request is already enabled
//    if(CheckBit(m_pInfo->pI2Sx->CR2, SPI_CR2_TXDMAEN) == 0)   ?? why ?
    {
        // Enable Tx DMA Request
        SET_BIT(m_pInfo->pI2Sx->CR2, SPI_CR2_TXDMAEN);
    }

    return SYS_READY;
}

/*
//-------------------------------------------------------------------------------------------------
//
//  Name:
//
//  Parameter(s):
//
//  Return:
//
//  Description:
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e I2S_Driver::TX_CompleteCallback(void)
{
    // Call the user function which will manage directly transfer complete
    // TODO call user callback
    return SYS_BUSY;
}

//-------------------------------------------------------------------------------------------------
//
//  Name:
//
//  Parameter(s):
//
//  Return:
//
//  Description:
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e I2S_Driver::TX_HalfCompleteCallback(void)
{
    // Manage the remaining file size and new address offset: This function should be coded by user
    // TODO call user callback
    return SYS_BUSY;
}
*/

//-------------------------------------------------------------------------------------------------

