aroyer-qc/Digini/Peripheral/src/port/STM32F1xx/lib_class_STM32F1_i2s.cpp
/*### RECORDER ###*/
I2S_HandleTypeDef                 hAudioInI2s;

/* PDM filters params */
PDM_Filter_Handler_t  PDM_FilterHandler[2];
PDM_Filter_Config_t   PDM_FilterConfig[2];

__IO uint16_t AudioInVolume = DEFAULT_AUDIO_IN_VOLUME;

static uint8_t I2S3_Init(uint32_t AudioFreq);
static uint8_t I2S2_Init(uint32_t AudioFreq);
static void PDMDecoder_Init(uint32_t AudioFreq, uint32_t ChnlNbrIn, uint32_t ChnlNbrOut);

/**
  * @brief  Configures the audio peripherals.
  * @param  OutputDevice: OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
  *                       OUTPUT_DEVICE_BOTH or OUTPUT_DEVICE_AUTO .
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to play the audio stream.
  * @retval SYS_READY if correct communication, else wrong communication
  */
SystemState_e I2S::InitInput(uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq)
{
    SystemState_e ret = SYS_READY;

    /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
    BSP_AUDIO_OUT_ClockConfig(&hAudioOutI2s, AudioFreq, NULL);

    /* I2S data transfer preparation:
    Prepare the Media to be used for the audio transfer from memory to I2S peripheral */
    hAudioOutI2s.Instance = I2S3;
    if(HAL_I2S_GetState(&hAudioOutI2s) == HAL_I2S_STATE_RESET)
    {
        /* Init the I2S MSP: this __weak function can be redefined by the application*/
        BSP_AUDIO_OUT_MspInit(&hAudioOutI2s, NULL);
    }

    /* I2S data transfer preparation: Prepare the Media to be used for the audio transfer from memory to I2S peripheral */
    /* Configure the I2S peripheral */
    if(I2S3_Init(AudioFreq) != SYS_READY)
    {
        ret = SYS_ERROR;
    }

    if(ret == SYS_READY)
    {
        /* Retieve audio codec identifier */
        if(((cs43l22_drv.ReadID(AUDIO_I2C_ADDRESS)) & CS43L22_ID_MASK) == CS43L22_ID)
        {
            /* Initialize the audio driver structure */
            pAudioDrv = &cs43l22_drv;
        }
        else
        {
            ret = SYS_ERROR;
        }
    }

    if(ret == SYS_READY)
    {
        pAudioDrv->Init(AUDIO_I2C_ADDRESS, OutputDevice, Volume, AudioFreq);
    }

    return ret;
}

/**
  * @brief  Starts playing audio stream from a data buffer for a determined size.
  * @param  pBuffer: Pointer to the buffer
  * @param  Size: Number of audio data BYTES.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_OUT_Play(uint16_t* pBuffer, uint32_t Size)
{
  /* Call the audio Codec Play function */
  if(pAudioDrv->Play(AUDIO_I2C_ADDRESS, pBuffer, Size) != 0)
  {
    return SYS_ERROR;
  }
  else
  {
    /* Update the Media layer and enable it for play */
    HAL_I2S_Transmit_DMA(&hAudioOutI2s, pBuffer, DMA_MAX(Size/AUDIODATA_SIZE));

    return SYS_READY;
  }
}

/**
  * @brief   Pauses the audio file stream. In case of using DMA, the DMA Pause
  *          feature is used.
  * WARNING: When calling BSP_AUDIO_OUT_Pause() function for pause, only the
  *          BSP_AUDIO_OUT_Resume() function should be called for resume (use of BSP_AUDIO_OUT_Play()
  *          function for resume could lead to unexpected behavior).
  * @retval  AUDIO_OK if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_OUT_Pause(void)
{
  /* Call the Audio Codec Pause/Resume function */
  if(pAudioDrv->Pause(AUDIO_I2C_ADDRESS) != 0)
  {
    return SYS_ERROR;
  }
  else
  {
    /* Call the Media layer pause function */
    HAL_I2S_DMAPause(&hAudioOutI2s);

    /* Return SYS_READY when all operations are correctly done */
    return SYS_READY;
  }
}

/**
  * @brief   Resumes the audio file streaming.
  * WARNING: When calling BSP_AUDIO_OUT_Pause() function for pause, only
  *          BSP_AUDIO_OUT_Resume() function should be called for resume (use of BSP_AUDIO_OUT_Play()
  *          function for resume could lead to unexpected behavior).
  * @retval  SYS_READY if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_OUT_Resume(void)
{
    /* Call the Audio Codec Pause/Resume function */
    if(pAudioDrv->Resume(AUDIO_I2C_ADDRESS) != 0)
    {
        return SYS_ERROR;
    }
    else
    {
        /* Call the Media layer resume function */
        HAL_I2S_DMAResume(&hAudioOutI2s);

        /* Return SYS_READY when all operations are correctly done */
        return SYS_READY;
    }
}

/**
  * @brief  Stops audio playing and Power down the Audio Codec.
  * @param  Option: could be one of the following parameters
  *           - CODEC_PDWN_HW: completely shut down the codec (physically).
  *                            Then need to reconfigure the Codec after power on.
  * @retval SYS_READY if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_OUT_Stop(uint32_t Option)
{
    /* Call DMA Stop to disable DMA stream before stopping codec */
    HAL_I2S_DMAStop(&hAudioOutI2s);

    /* Call Audio Codec Stop function */
    if(pAudioDrv->Stop(AUDIO_I2C_ADDRESS, Option) != 0)
    {
        return SYS_ERROR;
    }
    else
    {
        if(Option == CODEC_PDWN_HW)
        {
            /* Wait at least 1ms */
            HAL_Delay(1);

            /* Reset the pin */
            HAL_GPIO_WritePin(AUDIO_RESET_GPIO, AUDIO_RESET_PIN, GPIO_PIN_RESET);
        }

        /* Return SYS_READY when all operations are correctly done */
        return SYS_READY;
    }
}

/**
  * @brief  Controls the current audio volume level.
  * @param  Volume: Volume level to be set in percentage from 0% to 100% (0 for
  *         Mute and 100 for Max volume level).
  * @retval SYS_READY if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_OUT_SetVolume(uint8_t Volume)
{
    /* Call the codec volume control function with converted volume value */
    if(pAudioDrv->SetVolume(AUDIO_I2C_ADDRESS, Volume) != 0)
    {
        return SYS_ERROR;
    }
    else
    {
        /* Return SYS_READY when all operations are correctly done */
        return SYS_READY;
    }
}

/**
  * @brief  Enables or disables the MUTE mode by software
  * @param  Cmd: could be AUDIO_MUTE_ON to mute sound or AUDIO_MUTE_OFF to
  *         unmute the codec and restore previous volume level.
  * @retval SYS_READY if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_OUT_SetMute(uint32_t Cmd)
{
    /* Call the Codec Mute function */
    if(pAudioDrv->SetMute(AUDIO_I2C_ADDRESS, Cmd) != 0)
    {
        return SYS_ERROR;
    }
    else
    {
        /* Return SYS_READY when all operations are correctly done */
        return SYS_READY;
    }
}

/**
  * @brief  Switch dynamically (while audio file is played) the output target
  *         (speaker or headphone).
  * @note   This function modifies a global variable of the audio codec driver: OutputDev.
  * @param  Output: specifies the audio output target: OUTPUT_DEVICE_SPEAKER,
  *         OUTPUT_DEVICE_HEADPHONE, OUTPUT_DEVICE_BOTH or OUTPUT_DEVICE_AUTO
  * @retval SYS_READY if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_OUT_SetOutputMode(uint8_t Output)
{
    /* Call the Codec output Device function */
    if(pAudioDrv->SetOutputMode(AUDIO_I2C_ADDRESS, Output) != 0)
    {
        return SYS_ERROR;
    }
    else
    {
        /* Return SYS_READY when all operations are correctly done */
        return SYS_READY;
    }
}




/**
  * @brief  Manages the DMA FIFO error event.
  */
__weak void BSP_AUDIO_OUT_Error_CallBack(void)
{
}

