aroyer-qc/Digini/Peripheral/src/port/STM32F1xx/lib_class_STM32F1_i2s.cpp
   (#) Optionally, you can enable/configure the following parameters without
       re-initialization (i.e there is no need to call again SPI_Init() function):
       (++) When bidirectional mode (SPI_Direction_1Line_Rx or SPI_Direction_1Line_Tx)
            is programmed as Data direction parameter using the SPI_Init() function
            it can be possible to switch between SPI_Direction_Tx or SPI_Direction_Rx
            using the SPI_BiDirectionalLineConfig() function.
       (++) When SPI_NSS_Soft is selected as Slave Select Management parameter
            using the SPI_Init() function it can be possible to manage the
            NSS internal signal using the SPI_NSSInternalSoftwareConfig() function.
       (++) Reconfigure the data size using the SPI_DataSizeConfig() function
       (++) Enable or disable the SS output using the SPI_SSOutputCmd() function

    (#) To use the CRC Hardware calculation feature refer to the Peripheral
        CRC hardware Calculation subsection.


 [..] It is possible to use SPI in I2S full duplex mode, in this case, each SPI
      peripheral is able to manage sending and receiving data simultaneously
      using two data lines. Each SPI peripheral has an extended block called I2Sxext
      (ie. I2S2ext for SPI2 and I2S3ext for SPI3).
      The extension block is not a full SPI IP, it is used only as I2S slave to
      implement full duplex mode. The extension block uses the same clock sources
      as its master.
      To configure I2S full duplex you have to:

      (#) Configure SPIx in I2S mode (I2S_Init() function) as described above.

      (#) Call the I2S_FullDuplexConfig() function using the same strucutre passed to
          I2S_Init() function.

      (#) Call I2S_Cmd() for SPIx then for its extended block.

      (#) To configure interrupts or DMA requests and to get/clear flag status,
          use I2Sxext instance for the extension block.

 [..] Functions that can be called with I2Sxext instances are: I2S_Cmd(),
      I2S_FullDuplexConfig(), SPI_I2S_ReceiveData(), SPI_I2S_SendData(),
      SPI_I2S_DMACmd(), SPI_I2S_ITConfig(), SPI_I2S_GetFlagStatus(),
      SPI_I2S_ClearFlag(), SPI_I2S_GetITStatus() and SPI_I2S_ClearITPendingBit().

      Example: To use SPI3 in Full duplex mode (SPI3 is Master Tx, I2S3ext is Slave Rx):

      RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3, ENABLE);
      I2S_StructInit(&I2SInitStruct);
      I2SInitStruct.Mode = I2S_Mode_MasterTx;
      I2S_Init(SPI3, &I2SInitStruct);
      I2S_FullDuplexConfig(SPI3ext, &I2SInitStruct)
      I2S_Cmd(SPI3, ENABLE);
      I2S_Cmd(SPI3ext, ENABLE);
      ...
      while (SPI_I2S_GetFlagStatus(SPI2, SPI_FLAG_TXE) == RESET)
      {}
      SPI_I2S_SendData(SPI3, txdata[i]);
      ...
      while (SPI_I2S_GetFlagStatus(I2S3ext, SPI_FLAG_RXNE) == RESET)
      {}
      rxdata[i] = SPI_I2S_ReceiveData(I2S3ext);
      ...

   (@) In I2S mode: if an external clock is used as source clock for the I2S,
       then the define I2S_EXTERNAL_CLOCK_VAL in file stm32f4xx_conf.h should
       be enabled and set to the value of the source clock frequency (in Hz).

   (@) In SPI mode: To use the SPI TI mode, call the function SPI_TIModeCmd()
       just after calling the function SPI_Init().

  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_spi.h"
#include "stm32f4xx_rcc.h"

/** @defgroup SPI
  * @brief SPI driver modules
  */

/* SPI registers Masks */
#define CR1_CLEAR_MASK            ((uint16_t)0x3040)
#define I2SCFGR_CLEAR_MASK        ((uint16_t)0xF040)

/* RCC PLLs masks */
#define PLLCFGR_PPLR_MASK         ((uint32_t)0x70000000)
#define PLLCFGR_PPLN_MASK         ((uint32_t)0x00007FC0)

#define SPI_CR2_FRF               ((uint16_t)0x0010)
#define SPI_SR_TIFRFE             ((uint16_t)0x0100)

///** @defgroup SPI_Group1 Initialization and Configuration functions
// *  @brief   Initialization and Configuration functions
// *
// ===============================================================================
//             ##### Initialization and Configuration functions #####
// ===============================================================================
// [..] This section provides a set of functions allowing to initialize the SPI
//      Direction, SPI Mode, SPI Data Size, SPI Polarity, SPI Phase, SPI NSS
//      Management, SPI Baud Rate Prescaler, SPI First Bit and SPI CRC Polynomial.
//
// [..] The SPI_Init() function follows the SPI configuration procedures for Master
//      mode and Slave mode (details for these procedures are available in reference
//      manual (RM0090)).
//
///**
//  * @brief  Initializes the SPIx peripheral according to the specified
//  *         parameters in the I2S_InitStruct.
//  * @param  SPIx: where x can be  2 or 3 to select the SPI peripheral (configured in I2S mode).
//  * @param  I2S_InitStruct: pointer to an I2S_InitTypeDef structure that
//  *         contains the configuration information for the specified SPI peripheral
//  *         configured in I2S mode.
//  *
//  * @note   The function calculates the optimal prescaler needed to obtain the most
//  *         accurate audio frequency (depending on the I2S clock source, the PLL values
//  *         and the product configuration). But in case the prescaler value is greater
//  *         than 511, the default value (0x02) will be configured instead.
//  *
//  * @note   if an external clock is used as source clock for the I2S, then the define
//  *         I2S_EXTERNAL_CLOCK_VAL in file stm32f4xx_conf.h should be enabled and set
//  *         to the value of the the source clock frequency (in Hz).
//  *
//  * @retval None
//  */
void I2S_Init(SPI_TypeDef* SPIx, I2S_InitTypeDef* I2S_InitStruct)
{
  uint16_t tmpreg = 0, i2sdiv = 2, i2sodd = 0, packetlength = 1;
  uint32_t tmp = 0, i2sclk = 0;
#ifndef I2S_EXTERNAL_CLOCK_VAL
  uint32_t pllm = 0, plln = 0, pllr = 0;
#endif /* I2S_EXTERNAL_CLOCK_VAL */

/*----------------------- SPIx I2SCFGR & I2SPR Configuration -----------------*/
  /* Clear I2SMOD, I2SE, I2SCFG, PCMSYNC, I2SSTD, CKPOL, DATLEN and CHLEN bits */
  SPIx->I2SCFGR &= I2SCFGR_CLEAR_MASK;
  SPIx->I2SPR = 0x0002;

